package chapter06.ex01;





/*
 * 클래스 외부에 올수 있는 3가지
 * 		패키지 
 * 		import
 * 		외부 클래스 
 */
public class Object01 {
	

	//클래스 내부에 올수 있는 4가지 : 멤버 변수 (필드) , 메소드 , constructor, 내부 클래스 (Inner Class)
	
	
	
	
	public static void main(String[] args) {
		/*
		 * 절차 지향 프로그램 : C
		 * 	장점 :성능이 매우 우수하다 운영체제는 C나 C++로 개발 
		 * 
		 * 객체 지향 프로그래밍 : Java, C++
		 * 
		 * 장점: 모든 것들을 객체화 해서 프로그래밍 함 
		 * 	코드가 간결해진다
		 * 	문제가 생겼을때 유지 보수 하기가 쉽다
		 * 	문제가 생긴 객체만 수정
		 *  완성된 프로그램은 각각의 객체를 조합해서 완성
		 *  단점: 성능이 절차지향보다 느릴수 있다 
		 *  
		 *  
		 *  
		 */
		
		/*
		 *  class  객체를 생성하기 위한 틀 
		 *  object class를 기주능로 생성된 메모리에서 실행되는 프로그램 
		 */

		
	}
}











